# SQL en Python
<img src=".\img\image-4.png" alt="EDA Path"
    title="A typical EDA path" width="600" height="300" />
## Conectamos con la base de datos

### Documentación de la librería SQLite3 que vamos a utilizar:
https://docs.python.org/3/library/sqlite3.html

In [1]:
# Importamos librerias
import pandas as pd
import sqlite3

In [2]:
# Conectamos con la base de datos chinook.db
path = 'chinook.db'
connection = sqlite3.connect(path)

# Obtenemos un cursor que utilizaremos para hacer las queries
cursor = connection.cursor()

In [3]:
# Creamos una Query sencilla
query = """
SELECT *
FROM genres
"""

In [4]:
my_query = cursor.execute(query)

In [5]:
type(my_query.fetchall())

list

In [6]:
# Con esta función leemos los datos y lo pasamos a un DataFrame de Pandas
def sql_query(query):
    
    cursor.execute(query)
    datos_query = cursor.fetchall()
    col_names = [description[0] for description in cursor.description]

    return pd.DataFrame(datos_query, columns=col_names)

In [7]:
df = sql_query(query)
df

    GenreId                Name
0         1                Rock
1         2                Jazz
2         3               Metal
3         4  Alternative & Punk
4         5       Rock And Roll
5         6               Blues
6         7               Latin
7         8              Reggae
8         9                 Pop
9        10          Soundtrack
10       11          Bossa Nova
11       12      Easy Listening
12       13         Heavy Metal
13       14            R&B/Soul
14       15   Electronica/Dance
15       16               World
16       17         Hip Hop/Rap
17       18     Science Fiction
18       19            TV Shows
19       20    Sci Fi & Fantasy
20       21               Drama
21       22              Comedy
22       23         Alternative
23       24           Classical
24       25               Opera

In [8]:
# Tambien podemos obtener el mismo resultado directamente con pandas

pd.read_sql_query(query, connection)

    GenreId                Name
0         1                Rock
1         2                Jazz
2         3               Metal
3         4  Alternative & Punk
4         5       Rock And Roll
5         6               Blues
6         7               Latin
7         8              Reggae
8         9                 Pop
9        10          Soundtrack
10       11          Bossa Nova
11       12      Easy Listening
12       13         Heavy Metal
13       14            R&B/Soul
14       15   Electronica/Dance
15       16               World
16       17         Hip Hop/Rap
17       18     Science Fiction
18       19            TV Shows
19       20    Sci Fi & Fantasy
20       21               Drama
21       22              Comedy
22       23         Alternative
23       24           Classical
24       25               Opera

## Ya podemos comenzar con la práctica de chinook:
Antes de empezar a atacar una base de datos, tendremos que saber qué hay dentro, y para ello lo mejor es ver cómo es su **modelo de datos**

![imagen](./img/chinook_data_model.png)

### 1.	Facturas de Clientes de Brasil, Nombre del cliente, Id de factura, fecha de la factura y el país de la factura

In [9]:
query = """
SELECT c.CustomerId, c.FirstName||' '||c.LastName as 'FullName', i.InvoiceId, i.InvoiceDate, c.Country as 'CustomerCountry', i.BillingCountry
FROM customers as c, invoices as i
WHERE c.CustomerId == i.CustomerId
AND c.Country == 'Brazil'
"""
df = sql_query(query)
df

,CustomerId,FullName,InvoiceId,InvoiceDate,CustomerCountry,BillingCountry
0,1,Luís Gonçalves,98,2010-03-11 00:00:00,Brazil,Brazil
1,1,Luís Gonçalves,121,2010-06-13 00:00:00,Brazil,Brazil
2,1,Luís Gonçalves,143,2010-09-15 00:00:00,Brazil,Brazil
3,1,Luís Gonçalves,195,2011-05-06 00:00:00,Brazil,Brazil
4,1,Luís Gonçalves,316,2012-10-27 00:00:00,Brazil,Brazil
5,1,Luís Gonçalves,327,2012-12-07 00:00:00,Brazil,Brazil
6,1,Luís Gonçalves,382,2013-08-07 00:00:00,Brazil,Brazil
7,10,Eduardo Martins,25,2009-04-09 00:00:00,Brazil,Brazil
8,10,Eduardo Martins,154,2010-11-14 00:00:00,Brazil,Brazil
9,10,Eduardo Martins,177,2011-02-16 00:00:00,Brazil,Brazil
10,10,Eduardo Martins,199,2011-05-21 00:00:00,Brazil,Brazil
11,10,Eduardo Martins,251,2012-01-09 00:00:00,Brazil,Brazil
12,10,Eduardo Martins,372,2013-07-02 00:00:00,Brazil,Brazil
13,10,Eduardo Martins,383,2013-08-12 00:00:00,Brazil,Brazil
14,11,Alexandre Rocha,57,2009-09-06 00:00:00,Brazil,Brazil
15,11,Alexandre Rocha,68,2009-10-17 00:00:00,Brazil,Brazil
16,11,Alexandre Rocha,123,2010-06-17 00:00:00,Brazil,Brazil
17,11,Alexandre Rocha,252,2012-01-22 00:00:00,Brazil,Brazil
18,11,Alexandre Rocha,275,2012-04-25 00:00:00,Brazil,Brazil
19,11,Alexandre Rocha,297,2012-07-28 00:00:00,Brazil,Brazil
20,11,Alexandre Rocha,349,2013-03-18 00:00:00,Brazil,Brazil
21,12,Roberto Almeida,34,2009-05-23 00:00:00,Brazil,Brazil
22,12,Roberto Almeida,155,2010-11-14 00:00:00,Brazil,Brazil
23,12,Roberto Almeida,166,2010-12-25 00:00:00,Brazil,Brazil
24,12,Roberto Almeida,221,2011-08-25 00:00:00,Brazil,Brazil
25,12,Roberto Almeida,350,2013-03-31 00:00:00,Brazil,Brazil
26,12,Roberto Almeida,373,2013-07-03 00:00:00,Brazil,Brazil
27,12,Roberto Almeida,395,2013-10-05 00:00:00,Brazil,Brazil
28,13,Fernanda Ramos,35,2009-06-05 00:00:00,Brazil,Brazil
29,13,Fernanda Ramos,58,2009-09-07 00:00:00,Brazil,Brazil
30,13,Fernanda Ramos,80,2009-12-10 00:00:00,Brazil,Brazil
31,13,Fernanda Ramos,132,2010-07-31 00:00:00,Brazil,Brazil
32,13,Fernanda Ramos,253,2012-01-22 00:00:00,Brazil,Brazil
33,13,Fernanda Ramos,264,2012-03-03 00:00:00,Brazil,Brazil
34,13,Fernanda Ramos,319,2012-11-01 00:00:00,Brazil,Brazil

In [10]:
query = """
SELECT c.CustomerId, c.FirstName||' '||c.LastName as 'FullName', i.InvoiceId, i.InvoiceDate, c.Country as 'CustomerCountry', i.BillingCountry
FROM customers as c
JOIN invoices i ON c.CustomerId == i.CustomerId
AND c.Country == 'Brazil'
"""
df = sql_query(query)
df

,CustomerId,FullName,InvoiceId,InvoiceDate,CustomerCountry,BillingCountry
0,1,Luís Gonçalves,98,2010-03-11 00:00:00,Brazil,Brazil
1,1,Luís Gonçalves,121,2010-06-13 00:00:00,Brazil,Brazil
2,1,Luís Gonçalves,143,2010-09-15 00:00:00,Brazil,Brazil
3,1,Luís Gonçalves,195,2011-05-06 00:00:00,Brazil,Brazil
4,1,Luís Gonçalves,316,2012-10-27 00:00:00,Brazil,Brazil
5,1,Luís Gonçalves,327,2012-12-07 00:00:00,Brazil,Brazil
6,1,Luís Gonçalves,382,2013-08-07 00:00:00,Brazil,Brazil
7,10,Eduardo Martins,25,2009-04-09 00:00:00,Brazil,Brazil
8,10,Eduardo Martins,154,2010-11-14 00:00:00,Brazil,Brazil
9,10,Eduardo Martins,177,2011-02-16 00:00:00,Brazil,Brazil
10,10,Eduardo Martins,199,2011-05-21 00:00:00,Brazil,Brazil
11,10,Eduardo Martins,251,2012-01-09 00:00:00,Brazil,Brazil
12,10,Eduardo Martins,372,2013-07-02 00:00:00,Brazil,Brazil
13,10,Eduardo Martins,383,2013-08-12 00:00:00,Brazil,Brazil
14,11,Alexandre Rocha,57,2009-09-06 00:00:00,Brazil,Brazil
15,11,Alexandre Rocha,68,2009-10-17 00:00:00,Brazil,Brazil
16,11,Alexandre Rocha,123,2010-06-17 00:00:00,Brazil,Brazil
17,11,Alexandre Rocha,252,2012-01-22 00:00:00,Brazil,Brazil
18,11,Alexandre Rocha,275,2012-04-25 00:00:00,Brazil,Brazil
19,11,Alexandre Rocha,297,2012-07-28 00:00:00,Brazil,Brazil
20,11,Alexandre Rocha,349,2013-03-18 00:00:00,Brazil,Brazil
21,12,Roberto Almeida,34,2009-05-23 00:00:00,Brazil,Brazil
22,12,Roberto Almeida,155,2010-11-14 00:00:00,Brazil,Brazil
23,12,Roberto Almeida,166,2010-12-25 00:00:00,Brazil,Brazil
24,12,Roberto Almeida,221,2011-08-25 00:00:00,Brazil,Brazil
25,12,Roberto Almeida,350,2013-03-31 00:00:00,Brazil,Brazil
26,12,Roberto Almeida,373,2013-07-03 00:00:00,Brazil,Brazil
27,12,Roberto Almeida,395,2013-10-05 00:00:00,Brazil,Brazil
28,13,Fernanda Ramos,35,2009-06-05 00:00:00,Brazil,Brazil
29,13,Fernanda Ramos,58,2009-09-07 00:00:00,Brazil,Brazil
30,13,Fernanda Ramos,80,2009-12-10 00:00:00,Brazil,Brazil
31,13,Fernanda Ramos,132,2010-07-31 00:00:00,Brazil,Brazil
32,13,Fernanda Ramos,253,2012-01-22 00:00:00,Brazil,Brazil
33,13,Fernanda Ramos,264,2012-03-03 00:00:00,Brazil,Brazil
34,13,Fernanda Ramos,319,2012-11-01 00:00:00,Brazil,Brazil

### 2.	Facturas de Clientes de Brasil

In [11]:
query = """
SELECT i.*
FROM customers as c
JOIN invoices i ON c.CustomerId == i.CustomerId
AND c.Country == 'Brazil'
"""
df = sql_query(query)
df

,InvoiceId,CustomerId,InvoiceDate,BillingAddress,BillingCity,BillingState,BillingCountry,BillingPostalCode,Total
0,98,1,2010-03-11 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,3.98
1,121,1,2010-06-13 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,3.96
2,143,1,2010-09-15 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,5.94
3,195,1,2011-05-06 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,0.99
4,316,1,2012-10-27 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,1.98
5,327,1,2012-12-07 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,13.86
6,382,1,2013-08-07 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,8.91
7,25,10,2009-04-09 00:00:00,"Rua Dr. Falcão Filho, 155",São Paulo,SP,Brazil,01007-010,8.91
8,154,10,2010-11-14 00:00:00,"Rua Dr. Falcão Filho, 155",São Paulo,SP,Brazil,01007-010,1.98
9,177,10,2011-02-16 00:00:00,"Rua Dr. Falcão Filho, 155",São Paulo,SP,Brazil,01007-010,3.96
10,199,10,2011-05-21 00:00:00,"Rua Dr. Falcão Filho, 155",São Paulo,SP,Brazil,01007-010,5.94
11,251,10,2012-01-09 00:00:00,"Rua Dr. Falcão Filho, 155",São Paulo,SP,Brazil,01007-010,0.99
12,372,10,2013-07-02 00:00:00,"Rua Dr. Falcão Filho, 155",São Paulo,SP,Brazil,01007-010,1.98
13,383,10,2013-08-12 00:00:00,"Rua Dr. Falcão Filho, 155",São Paulo,SP,Brazil,01007-010,13.86
14,57,11,2009-09-06 00:00:00,"Av. Paulista, 2022",São Paulo,SP,Brazil,01310-200,1.98
15,68,11,2009-10-17 00:00:00,"Av. Paulista, 2022",São Paulo,SP,Brazil,01310-200,13.86
16,123,11,2010-06-17 00:00:00,"Av. Paulista, 2022",São Paulo,SP,Brazil,01310-200,8.91
17,252,11,2012-01-22 00:00:00,"Av. Paulista, 2022",São Paulo,SP,Brazil,01310-200,1.98
18,275,11,2012-04-25 00:00:00,"Av. Paulista, 2022",São Paulo,SP,Brazil,01310-200,3.96
19,297,11,2012-07-28 00:00:00,"Av. Paulista, 2022",São Paulo,SP,Brazil,01310-200,5.94
20,349,11,2013-03-18 00:00:00,"Av. Paulista, 2022",São Paulo,SP,Brazil,01310-200,0.99
21,34,12,2009-05-23 00:00:00,"Praça Pio X, 119",Rio de Janeiro,RJ,Brazil,20040-020,0.99
22,155,12,2010-11-14 00:00:00,"Praça Pio X, 119",Rio de Janeiro,RJ,Brazil,20040-020,1.98
23,166,12,2010-12-25 00:00:00,"Praça Pio X, 119",Rio de Janeiro,RJ,Brazil,20040-020,13.86
24,221,12,2011-08-25 00:00:00,"Praça Pio X, 119",Rio de Janeiro,RJ,Brazil,20040-020,8.91
25,350,12,2013-03-31 00:00:00,"Praça Pio X, 119",Rio de Janeiro,RJ,Brazil,20040-020,1.98
26,373,12,2013-07-03 00:00:00,"Praça Pio X, 119",Rio de Janeiro,RJ,Brazil,20040-020,3.96
27,395,12,2013-10-05 00:00:00,"Praça Pio X, 119",Rio de Janeiro,RJ,Brazil,20040-020,5.94
28,35,13,2009-06-05 00:00:00,Qe 7 Bloco G,Brasília,DF,Brazil,71020-677,1.98
29,58,13,2009-09-07 00:00:00,Qe 7 Bloco G,Brasília,DF,Brazil,71020-677,3.96
30,80,13,2009-12-10 00:00:00,Qe 7 Bloco G,Brasília,DF,Brazil,71020-677,5.94
31,132,13,2010-07-31 00:00:00,Qe 7 Bloco G,Brasília,DF,Brazil,71020-677,0.99
32,253,13,2012-01-22 00:00:00,Qe 7 Bloco G,Brasília,DF,Brazil,71020-677,1.98
33,264,13,2012-03-03 00:00:00,Qe 7 Bloco G,Brasília,DF,Brazil,71020-677,13.86
34,319,13,2012-11-01 00:00:00,Qe 7 Bloco G,Brasília,DF,Brazil,71020-677,8.91

### 3.	Muestra cada factura asociada a cada agente de ventas con su nombre completo.

In [12]:
%%timeit

query = """
SELECT e.FirstName||' '||e.LastName as 'FullName', i.*
FROM employees as e
JOIN customers as c ON e.EmployeeId == c.SupportRepId
JOIN invoices as i ON c.CustomerId == i.CustomerId
"""
df = sql_query(query)
df

2.88 ms ± 280 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [13]:
%%timeit

query = """
SELECT e.FirstName||' '||e.LastName as 'FullName', i.*
FROM employees as e
JOIN customers as c, invoices as i ON e.EmployeeId == c.SupportRepId
AND c.CustomerId == i.CustomerId
"""
df = sql_query(query)
df

3.2 ms ± 396 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [14]:
df

,InvoiceId,CustomerId,InvoiceDate,BillingAddress,BillingCity,BillingState,BillingCountry,BillingPostalCode,Total
0,98,1,2010-03-11 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,3.98
1,121,1,2010-06-13 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,3.96
2,143,1,2010-09-15 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,5.94
3,195,1,2011-05-06 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,0.99
4,316,1,2012-10-27 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,1.98
5,327,1,2012-12-07 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,13.86
6,382,1,2013-08-07 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,8.91
7,25,10,2009-04-09 00:00:00,"Rua Dr. Falcão Filho, 155",São Paulo,SP,Brazil,01007-010,8.91
8,154,10,2010-11-14 00:00:00,"Rua Dr. Falcão Filho, 155",São Paulo,SP,Brazil,01007-010,1.98
9,177,10,2011-02-16 00:00:00,"Rua Dr. Falcão Filho, 155",São Paulo,SP,Brazil,01007-010,3.96
10,199,10,2011-05-21 00:00:00,"Rua Dr. Falcão Filho, 155",São Paulo,SP,Brazil,01007-010,5.94
11,251,10,2012-01-09 00:00:00,"Rua Dr. Falcão Filho, 155",São Paulo,SP,Brazil,01007-010,0.99
12,372,10,2013-07-02 00:00:00,"Rua Dr. Falcão Filho, 155",São Paulo,SP,Brazil,01007-010,1.98
13,383,10,2013-08-12 00:00:00,"Rua Dr. Falcão Filho, 155",São Paulo,SP,Brazil,01007-010,13.86
14,57,11,2009-09-06 00:00:00,"Av. Paulista, 2022",São Paulo,SP,Brazil,01310-200,1.98
15,68,11,2009-10-17 00:00:00,"Av. Paulista, 2022",São Paulo,SP,Brazil,01310-200,13.86
16,123,11,2010-06-17 00:00:00,"Av. Paulista, 2022",São Paulo,SP,Brazil,01310-200,8.91
17,252,11,2012-01-22 00:00:00,"Av. Paulista, 2022",São Paulo,SP,Brazil,01310-200,1.98
18,275,11,2012-04-25 00:00:00,"Av. Paulista, 2022",São Paulo,SP,Brazil,01310-200,3.96
19,297,11,2012-07-28 00:00:00,"Av. Paulista, 2022",São Paulo,SP,Brazil,01310-200,5.94
20,349,11,2013-03-18 00:00:00,"Av. Paulista, 2022",São Paulo,SP,Brazil,01310-200,0.99
21,34,12,2009-05-23 00:00:00,"Praça Pio X, 119",Rio de Janeiro,RJ,Brazil,20040-020,0.99
22,155,12,2010-11-14 00:00:00,"Praça Pio X, 119",Rio de Janeiro,RJ,Brazil,20040-020,1.98
23,166,12,2010-12-25 00:00:00,"Praça Pio X, 119",Rio de Janeiro,RJ,Brazil,20040-020,13.86
24,221,12,2011-08-25 00:00:00,"Praça Pio X, 119",Rio de Janeiro,RJ,Brazil,20040-020,8.91
25,350,12,2013-03-31 00:00:00,"Praça Pio X, 119",Rio de Janeiro,RJ,Brazil,20040-020,1.98
26,373,12,2013-07-03 00:00:00,"Praça Pio X, 119",Rio de Janeiro,RJ,Brazil,20040-020,3.96
27,395,12,2013-10-05 00:00:00,"Praça Pio X, 119",Rio de Janeiro,RJ,Brazil,20040-020,5.94
28,35,13,2009-06-05 00:00:00,Qe 7 Bloco G,Brasília,DF,Brazil,71020-677,1.98
29,58,13,2009-09-07 00:00:00,Qe 7 Bloco G,Brasília,DF,Brazil,71020-677,3.96
30,80,13,2009-12-10 00:00:00,Qe 7 Bloco G,Brasília,DF,Brazil,71020-677,5.94
31,132,13,2010-07-31 00:00:00,Qe 7 Bloco G,Brasília,DF,Brazil,71020-677,0.99
32,253,13,2012-01-22 00:00:00,Qe 7 Bloco G,Brasília,DF,Brazil,71020-677,1.98
33,264,13,2012-03-03 00:00:00,Qe 7 Bloco G,Brasília,DF,Brazil,71020-677,13.86
34,319,13,2012-11-01 00:00:00,Qe 7 Bloco G,Brasília,DF,Brazil,71020-677,8.91

### 4.	Para cada factura muestra el nombre del cliente, el país, el nombre del agente y el total

In [15]:
query = """
SELECT c.FirstName||' '||c.LastName as 'ClientName', i.BillingCountry, e.FirstName||' '||e.LastName as 'AgentName', i.total
FROM employees as e
JOIN customers as c, invoices as i ON e.EmployeeId == c.SupportRepId
AND c.CustomerId == i.CustomerId
"""
df = sql_query(query)
df

          ClientName BillingCountry     AgentName  Total
0     Luís Gonçalves         Brazil  Jane Peacock   3.98
1     Luís Gonçalves         Brazil  Jane Peacock   3.96
2     Luís Gonçalves         Brazil  Jane Peacock   5.94
3     Luís Gonçalves         Brazil  Jane Peacock   0.99
4     Luís Gonçalves         Brazil  Jane Peacock   1.98
..               ...            ...           ...    ...
407  Puja Srivastava          India  Jane Peacock   5.94
408  Puja Srivastava          India  Jane Peacock   1.99
409  Puja Srivastava          India  Jane Peacock   1.98
410  Puja Srivastava          India  Jane Peacock  13.86
411  Puja Srivastava          India  Jane Peacock   8.91

[412 rows x 4 columns]

### 5.	Muestra cada artículo de la factura con el nombre de la canción.

In [16]:
query = """
SELECT i.*, t.Name
FROM invoice_items as i
JOIN tracks as t ON t.TrackId == i.TrackId
"""
df = sql_query(query)
df

,InvoiceLineId,InvoiceId,TrackId,UnitPrice,Quantity,Name
0,1,1,2,0.99,1,Balls to the Wall
1,2,1,4,0.99,1,Restless and Wild
2,3,2,6,0.99,1,Put The Finger On You
3,4,2,8,0.99,1,Inject The Venom
4,5,2,10,0.99,1,Evil Walks
...,...,...,...,...,...,...
2235,2236,411,3136,0.99,1,Looking For Love
2236,2237,411,3145,0.99,1,Sweet Lady Luck
2237,2238,411,3154,0.99,1,Feirinha da Pavuna/Luz do Repente/Bagaço da La...
2238,2239,411,3163,0.99,1,Samba pras moças
2239,2240,412,3177,1.99,1,Hot Girl

### 6.	Muestra todas las canciones con su nombre, formato, álbum y género.

In [17]:
query = """
SELECT t.Name, mt.Name as 'Format', a.Title as 'Album', g.Name as 'Genre'
FROM tracks as t
JOIN media_types as mt ON mt.MediaTypeId == t.MediaTypeId
JOIN albums as a ON a.AlbumId == t.AlbumId
JOIN genres as g ON g.GenreId == t.GenreId
"""
df = sql_query(query)
df

,Name,Format,Album,Genre
0,For Those About To Rock (We Salute You),MPEG audio file,For Those About To Rock We Salute You,Rock
1,Balls to the Wall,Protected AAC audio file,Balls to the Wall,Rock
2,Fast As a Shark,Protected AAC audio file,Restless and Wild,Rock
3,Restless and Wild,Protected AAC audio file,Restless and Wild,Rock
4,Princess of the Dawn,Protected AAC audio file,Restless and Wild,Rock
...,...,...,...,...
3498,Pini Di Roma (Pinien Von Rom) \ I Pini Della V...,Protected AAC audio file,Respighi:Pines of Rome,Classical
3499,"String Quartet No. 12 in C Minor, D. 703 ""Quar...",Protected AAC audio file,Schubert: The Late String Quartets & String Qu...,Classical
3500,"L'orfeo, Act 3, Sinfonia (Orchestra)",Protected AAC audio file,Monteverdi: L'Orfeo,Classical
3501,"Quintet for Horn, Violin, 2 Violas, and Cello ...",Protected AAC audio file,Mozart: Chamber Music,Classical
3502,"Die Zauberflöte, K.620: ""Der Hölle Rache Kocht...",Protected AAC audio file,Mozart Gala: Famous Arias,Opera

### 7.	Muestra cuántas canciones hay en cada playlist y el nombre de cada playlist.

In [23]:
query = """
SELECT p.Name as 'Playlist', COUNT(*) as 'Nº Songs'
FROM playlist_track pt
JOIN playlists p ON p.PlaylistId == pt.PlaylistId
GROUP BY p.PLaylistId
"""
df = sql_query(query)
df

                      Playlist  Nº Songs
0                        Music      3290
1                     TV Shows       213
2                   90’s Music      1477
3                        Music      3290
4                 Music Videos         1
5                     TV Shows       213
6              Brazilian Music        39
7                    Classical        75
8    Classical 101 - Deep Cuts        25
9   Classical 101 - Next Steps        25
10  Classical 101 - The Basics        25
11                      Grunge        15
12         Heavy Metal Classic        26
13                 On-The-Go 1         1

### 8.	Muestra cuánto ha vendido cada empleado.

In [26]:
query = """
SELECT e.FirstName||' '||e.LastName as 'Employee', SUM(Total) as 'Sales'
FROM invoices i
JOIN customers c ON c.CustomerId == i.CustomerId
JOIN employees e ON c.SupportRepId == e.EmployeeId
GROUP BY e.EmployeeId
"""
df = sql_query(query)
df

        Employee   Sales
0   Jane Peacock  833.04
1  Margaret Park  775.40
2  Steve Johnson  720.16

### 9.	¿Quién ha sido el agente de ventas que más ha vendido en 2009?

In [35]:
query = """
SELECT e.FirstName||' '||e.LastName as 'Employee', SUM(Total) as 'Sales'
FROM invoices i
JOIN customers c ON c.CustomerId == i.CustomerId
JOIN employees e ON c.SupportRepId == e.EmployeeId
WHERE i.InvoiceDate LIKE '2009%'
GROUP BY e.EmployeeId
ORDER BY Sales DESC
LIMIT 1
"""
df = sql_query(query)
df

        Employee   Sales
0  Steve Johnson  164.34

### 10.	¿Cuáles son los 3 grupos que más han vendido?

In [39]:
query = """
SELECT a.Name as 'Grupo', SUM(Total) as 'Sales'
FROM artists a
JOIN albums al ON a.ArtistId == al.ArtistId
JOIN tracks t ON al.AlbumId == t.AlbumId
JOIN invoice_items ii ON ii.TrackId == t.TrackId
JOIN invoices i ON ii.InvoiceId == i.InvoiceId
GROUP BY a.ArtistId
ORDER BY Sales DESC
LIMIT 3
"""
df = sql_query(query)
df

         Grupo    Sales
0  Iron Maiden  1233.54
1           U2   895.59
2         Lost   833.70

### 11. Muestra cuántas canciones de Rock hay en cada playlist

In [40]:
query = """
SELECT p.Name as 'Playlist', COUNT(*) as 'Nº canciones Rock'
FROM genres g
JOIN tracks t ON g.GenreId == t.GenreId
JOIN playlist_track pt ON t.TrackId == pt.TrackId
JOIN playlists p ON pt.PlaylistId == p.PlaylistId
WHERE g.Name == 'Rock'
GROUP BY p.PlaylistId
"""
df = sql_query(query)
df

              Playlist  Nº canciones Rock
0                Music               1297
1           90’s Music                621
2                Music               1297
3               Grunge                 14
4  Heavy Metal Classic                  9

### 12. Muestra una tabla con todas canciones y su(s) Id de factura, hayan sido vendidas alguna vez o no.

In [52]:
query = """
SELECT t.Name as 'Song Name', i.InvoiceId
FROM tracks t
LEFT JOIN invoice_items i ON t.TrackId == i.TrackId
"""
df = sql_query(query)
df

                                              Song Name  InvoiceId
0               For Those About To Rock (We Salute You)      108.0
1                                     Balls to the Wall        1.0
2                                     Balls to the Wall      214.0
3                                       Fast As a Shark      319.0
4                                     Restless and Wild        1.0
...                                                 ...        ...
3754  String Quartet No. 12 in C Minor, D. 703 "Quar...      108.0
3755  String Quartet No. 12 in C Minor, D. 703 "Quar...      319.0
3756               L'orfeo, Act 3, Sinfonia (Orchestra)        NaN
3757  Quintet for Horn, Violin, 2 Violas, and Cello ...        NaN
3758                                      Koyaanisqatsi        NaN

[3759 rows x 2 columns]

### 13. ¿Cuántos artistas no tienen ningún album?

In [18]:
query = """
SELECT COUNT(*) as 'Artistas sin Album'
FROM artists a
LEFT JOIN albums b ON a.ArtistId == b.ArtistId
WHERE b.Title IS NULL
"""
df = sql_query(query)
df

   Artistas sin Album
0                  71